---
kind: property
id: P:Autodesk.Revit.DB.LineSegment.StartParameter
source: html/0b81c906-30de-5d34-fe23-1d30bf1c47bc.htm
---
# Autodesk.Revit.DB.LineSegment.StartParameter Property

Parameter associated with the start point.

## Syntax (C#)
```csharp
public double StartParameter { get; }
```